# FloorAreaFaceFailed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..FloorAreaFaceFailed Property
BuiltInFailures..::..MassFailures Class See Also
---
Failed to create a Mass Floor.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FloorAreaFaceFailed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FloorAreaFaceFailed As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FloorAreaFaceFailed {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace